Repository: BicanMarianValeriu/wca-google-connect
Catalog: languages/wca-google-*.po
Languages: ro_ro

source: Awesome, WCA: Google Tools extension is activated!
ro_ro: Minunat, WCA: Extensia Instrumente Google este activată!

source: Go to Theme Options in order to setup your Google services.
ro_ro: Accesați opțiunile temei pentru a vă configura serviciile Google.

source: Leave a Review
ro_ro: Lasă o recenzie

source: Navigate to the extension settings.
ro_ro: Navigați la setările extensiei.

source: Review plugin on WordPress.org
ro_ro: Examinați pluginul pe WordPress.org

source: Settings
ro_ro: Setări

source: Show me the options!
ro_ro: Arată-mi opțiunile!

source: This plugin requires WeCodeArt Framework (or a skin) installed and active.
ro_ro: Acest plugin necesită WeCodeArt Framework (sau un skin) instalat și activ.

source: WCA Google Tools extension for WeCodeArt Framework - Allows you to verify site ownership, add Google Analytics and connect Google Adsense Publisher account.
ro_ro: Extensia WCA Google Tools pentru WeCodeArt Framework - Vă permite să verificați calitatea de proprietar al site-ului, să adăugați Google Analytics și să conectați contul de editor Google Adsense.

source: WCA: Google Tools Extension
ro_ro: WCA: Extensia Instrumente Google
